Catalogs/УчетныеПолитики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>УчетныеПолитики</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаДоходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаРасходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаНераспределеннойПрибылиУбытка</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоходыКР</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДоходовКР</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиДоходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасходыКР</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходовКР</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоходыОтРазницПриПересчетеВП</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДоходовОтРазницПересчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиДоходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасходыОтРазницПриПересчетеВП</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходовОтРазницПересчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СчетаДоходов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СчетаРасходов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СчетаПрибылейУбытков</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсключитьИзПересчетаВП</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/УчетныеПолитики/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Структура реквизитов элемента справочника содержащие счета закрытия.
//
// Возвращаемое значение:
//   <Структура> - в ключах структуры имена реквизитов (табличных частей) счетов закрытия.
//
Функция СчетаЗакрытия() Экспорт

	Результат = Новый Структура;
	
	ПустойСчет = ПланыСчетов.Международный.ПустаяСсылка();
	Результат.Вставить("СчетУчетаДоходов",	ПустойСчет);
	Результат.Вставить("СчетУчетаРасходов", ПустойСчет);
	Результат.Вставить("СчетУчетаНераспределеннойПрибылиУбытка", ПустойСчет);
	
	ПустаяТЗ = Новый ТаблицаЗначений;
	ПустаяТЗ.Колонки.Добавить("Счет", Новый ОписаниеТипов("ПланСчетовСсылка.Международный"));
	Результат.Вставить("СчетаДоходов",	ПустаяТЗ);
	Результат.Вставить("СчетаРасходов",	ПустаяТЗ);
	Результат.Вставить("СчетаПрибылейУбытков",ПустаяТЗ);
	
	Возврат Результат;

КонецФункции // СчетаЗакрытия()

// Структура реквизитов элемента справочника содержащие счета отражения курсовых разниц.
//
// Возвращаемое значение:
//   <Структура> - в ключах структуры имена реквизитов (табличных частей) счетов отражения курсовых разниц.
//
Функция СчетаКурсовыхРазниц() Экспорт

	Результат = Новый Структура;
	
	ПустойСчет = ПланыСчетов.Международный.ПустаяСсылка();
	Результат.Вставить("ДоходыКР", ПустойСчет);
	Результат.Вставить("СтатьяДоходовКР", Неопределено);
	
	Результат.Вставить("РасходыКР", ПустойСчет);
	Результат.Вставить("СтатьяРасходовКР", Неопределено);
	
	Результат.Вставить("ДоходыОтРазницПриПересчетеВП", ПустойСчет);
	Результат.Вставить("СтатьяДоходовОтРазницПересчета", Неопределено);
	
	Результат.Вставить("РасходыОтРазницПриПересчетеВП", ПустойСчет);
	Результат.Вставить("СтатьяРасходовОтРазницПересчета", Неопределено);
	
	ПустаяТЗ = Новый ТаблицаЗначений;
	ПустаяТЗ.Колонки.Добавить("Счет", Новый ОписаниеТипов("ПланСчетовСсылка.Международный"));
	Результат.Вставить("ИсключитьИзРасчетаКР",	ПустаяТЗ);
	Результат.Вставить("ИсключитьИзПересчетаВП",ПустаяТЗ);
	
	Возврат Результат;

КонецФункции // СчетаКурсовыхРазниц()

// Возвращает таблицу счетов исключения из расчета курсовых разниц.
//
// Возвращаемое значение:
//  ТаблицаЗначений - счета учета исключаемые из расчета курсовых разниц.
//
Функция СчетаИсключенияРасчетаКР() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Международный.Ссылка КАК Счет,
	|	Международный.ИсключитьИзРасчетаКурсовыхРазниц КАК Исключить,
	|	Международный.Порядок КАК Порядок
	|ИЗ
	|	ПланСчетов.Международный КАК Международный
	|ГДЕ
	|	Международный.ИсключитьИзРасчетаКурсовыхРазниц = ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Отчеты

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//   Параметры - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
